The `netflix` dictionary contains a list of 100 titles along with their total number of views in the past. Based on the keys and values provided in this dictionary, answer the questions given below.

In [2]:
netflix = {'The Debt Collector': 1821195, 'Act of Vengeance': 2804479, 'Paradise Lost': 2195477, "Gerald's Game": 3650626, 'Long Shot': 638440, 'Mak Cun': 1010311, 'Our Souls at Night': 3028705, 'Out of Thin Air': 2681938, "Paul Hollywood's Big Continental Road Trip": 230689, 'Satu Hari': 1012350, 'Monster High: Boo York, Boo York': 1526025, 'Cultivating the Seas: History and Future of the Full-Cycle Cultured Kindai Tuna': 2762103, 'Domino': 872663, 'TUNA GIRL': 2574816, '5CM': 2647713, 'Animal World': 220789, 'Hold the Dark': 2307432, 'Lessons from a School Shooting: Notes from Dunblane': 2419534, 'Made in Mexico': 3653712, 'Single': 239278, 'The 3rd Eye': 196138, 'The Sinking Of Van Der Wijck': 2831856, 'Two Catalonias': 1337119, 'Bobby Sands: 66 Days': 2005623, 'Bard of Blood': 744998, 'Deliha 2': 3638900, 'Dragons: Rescue Riders': 3241239, 'In the Shadow of the Moon': 1213329, 'Skylines': 1840094, 'Sturgill Simpson Presents Sound & Fury': 1915540, 'The Politician': 1019394, 'Weeds on Fire': 2273090, 'Much Loved': 3039852, 'Joseph: King of Dreams': 1734449, 'Malaal': 1926128, 'The Grandmaster': 2549410, 'The Inmate': 130965, 'The Hurricane Heist': 2191538, 'Def Comedy Jam 25': 1392697, 'Restless Creature: Wendy Whelan': 2474412, 'Print the Legend': 548250, 'Birders': 3478883, 'Furie': 2755115, 'Leap!': 1401638, 'Oh! Baby (Malayalam)': 839139, 'Oh! Baby (Tamil)': 2691505, 'USS Indianapolis: Men of Courage': 3286014, 'A Wrinkle in Time': 1258861, 'Teach Us All': 2428947, 'White Island': 1152905, 'Inside Man: Most Wanted': 2812661, 'Jeff Dunham: Beside Himself': 2930368, 'China Salesman': 3377292, 'Swearnet: The Movie': 949689, 'The Bar': 620655, 'Manmadhudu 2': 1842761, 'Team Kaylie': 359856, 'Under the Eiffel Tower': 2298237, 'Audrie & Daisy': 1573055, 'Iliza Shlesinger: Confirmed Kills': 365220, 'BONDING': 1664242, 'Do Paise Ki Dhoop Chaar Aane Ki Baarish': 2770879, '20 Feet From Stardom': 2931730, 'In Darkness': 3248749, 'Gaga: Five Foot Two': 3719550, 'The Bad Batch': 3656264, 'SMOSH: The Movie': 3697506, 'King of Boys': 584112, 'Merry Men: The Real Yoruba Demons': 2035595, "Sarah's Key": 1337902, 'The Wedding Party 2: Destination Dubai': 1471204, 'Vagabond': 1600432, 'Battlefish': 723021, 'DRAGON PILOT: Hisone & Masotan': 602919, 'Hilda': 54948, 'Maniac': 1348196, 'Quincy': 2601704, 'Rafinha Bastos: Ultimatum': 3469996, 'The Good Cop': 2265521, 'Between Two Ferns: The Movie': 3146508, 'Criminal: France': 2021409, 'Criminal: Germany': 658824, 'Criminal: Spain': 3078634, 'Criminal: UK': 2721398, 'Daddy Issues': 2119035, "Inside Bill's Brain: Decoding Bill Gates": 1755104, 'The Hockey Girls': 2000507, 'Travel Mates 2': 707260, 'True: Tricky Treat Day': 3213199, 'Two Sentence Horror Stories': 2438329, 'Mad World': 2281773, 'Mobile Suit Gundam UC': 778879, 'The Bund': 1729892, 'The First Line': 674591, 'Maynard': 84986, 'Monkey Twins': 3277179, 'Bitcoin Heist': 1450158, 'I Am Not Madame Bovary': 2763830, 'Vincent N Roxxy': 1961810, "Chef's Table: France": 2065738}

In [3]:
netflix['Do Paise Ki Dhoop Chaar Aane Ki Baarish']

2770879

#### Q1. There's an Indian movie in the dictionary named `Do Paise Ki Dhoop Chaar Aane Ki Baarish`. What is the number of views for this movie?
- 90,854
- 658,824
- 1,023,597
- 2,770,879

#### Q2. Which of the shows is the most and least popular in terms of number of views? </br> 
(Hint: Use the `key` argument in the max() and min() functions.)
- Monkey Twins, Maynard
- Gaga: Five Foot Two, Hilda
- Gerald's Game, White Island
- Rafinha Bastos: Ultimatum, The First Line

Netflix has just recieved the number of views for the last week as well. This data is given below, in the form of a dictionary

In [ ]:
netflix_last_week = {'The Debt Collector': 229218, 'Act of Vengeance': 191468, 'Paradise Lost': 167846, "Gerald's Game": 113298, 'Long Shot': 15190, 'Mak Cun': 244581, 'Our Souls at Night': 188095, 'Out of Thin Air': 183961, "Paul Hollywood's Big Continental Road Trip": 207967, 'Satu Hari': 226211, 'Monster High: Boo York, Boo York': 265919, 'Cultivating the Seas: History and Future of the Full-Cycle Cultured Kindai Tuna': 192246, 'Domino': 190538, 'TUNA GIRL': 301819, '5CM': 154371, 'Animal World': 228227, 'Hold the Dark': 222938, 'Lessons from a School Shooting: Notes from Dunblane': 256580, 'Made in Mexico': 199790, 'Single': 155517, 'The 3rd Eye': 251349, 'The Sinking Of Van Der Wijck': 153797, 'Two Catalonias': 189422, 'Bobby Sands: 66 Days': 202461, 'Bard of Blood': 241928, 'Deliha 2': 304552, 'Dragons: Rescue Riders': 155149, 'In the Shadow of the Moon': 222999, 'Skylines': 118737, 'Sturgill Simpson Presents Sound & Fury': 43590, 'The Politician': 11902, 'Weeds on Fire': 243382, 'Much Loved': 190123, 'Joseph: King of Dreams': 46104, 'Malaal': 70961, 'The Grandmaster': 44908, 'The Inmate': 19574, 'The Hurricane Heist': 167696, 'Def Comedy Jam 25': 208075, 'Restless Creature: Wendy Whelan': 22976, 'Print the Legend': 161584, 'Birders': 257668, 'Furie': 282266, 'Leap!': 124338, 'Oh! Baby (Malayalam)': 18203, 'Oh! Baby (Tamil)': 131481, 'USS Indianapolis: Men of Courage': 76558, 'A Wrinkle in Time': 169365, 'Teach Us All': 50378, 'White Island': 299779, 'Inside Man: Most Wanted': 123346, 'Jeff Dunham: Beside Himself': 283561, 'China Salesman': 182041, 'Swearnet: The Movie': 63809, 'The Bar': 41243, 'Manmadhudu 2': 261349, 'Team Kaylie': 101283, 'Under the Eiffel Tower': 83650, 'Audrie & Daisy': 106092, 'Iliza Shlesinger: Confirmed Kills': 255103, 'BONDING': 202683, 'Do Paise Ki Dhoop Chaar Aane Ki Baarish': 32329, '20 Feet From Stardom': 165178, 'In Darkness': 95259, 'Gaga: Five Foot Two': 36638, 'The Bad Batch': 197820, 'SMOSH: The Movie': 196519, 'King of Boys': 49332, 'Merry Men: The Real Yoruba Demons': 293229, "Sarah's Key": 178523, 'The Wedding Party 2: Destination Dubai': 51211, 'Vagabond': 116831, 'Battlefish': 5448, 'DRAGON PILOT: Hisone & Masotan': 281873, 'Hilda': 21348, 'Maniac': 268187, 'Quincy': 139696, 'Rafinha Bastos: Ultimatum': 105449, 'The Good Cop': 73230, 'Between Two Ferns: The Movie': 135600, 'Criminal: France': 243469, 'Criminal: Germany': 285211, 'Criminal: Spain': 45184, 'Criminal: UK': 117056, 'Daddy Issues': 267329, "Inside Bill's Brain: Decoding Bill Gates": 64083, 'The Hockey Girls': 114146, 'Travel Mates 2': 21088, 'True: Tricky Treat Day': 116504, 'Two Sentence Horror Stories': 274471, 'Mad World': 225244, 'Mobile Suit Gundam UC': 47306, 'The Bund': 146872, 'The First Line': 148861, 'Maynard': 87252, 'Monkey Twins': 199274, 'Bitcoin Heist': 41105, 'I Am Not Madame Bovary': 57841, 'Vincent N Roxxy': 207453, "Chef's Table: France": 200536}

In [5]:
a=11

b=12

c=13 

d=14

print('{0} {1} {2}'.format(a,b,c) )

print(d)

11 12 13
14

In [7]:
s = {'aki','ani','ravi','bhanu','lavu'}
x = {'aki','anu','ravi','ss','dd'}
print(s.intersection(x))

{'ravi', 'aki'}

#### Q3. Netflix has just recieved the number of views for the last week as well. Add these views to the total views and find the most popular title in terms of views. Also find out how many views this title has? 
- Title: Deliha 2, Views: 3943452
- Title: Dragons: Rescue Riders, Views: 3996388
- Title: Rafinha Bastos: Ultimatum, Views: 3575445
- Title: Gaga: Five Foot Two, Views: 3756188

In [9]:
in_string=input()

list1 = in_string.split(',')
x = list1[0]
y = list1[1]

print('x before swapping:',x)
print("y before swapping:",y)
z=y
y=x
x=z
print()
print('x after swapping:',x)
print('y after swapping:',y)

29,89
x before swapping: 29
y before swapping: 89

x after swapping: 89
y after swapping: 29

In [12]:
k=int(input())

for i in range(k,k+3):
    if k==k:
        print('sexy')
    k+=1
     elif k==k+1:
        print('beautiful')
    else:
      print('pretty')

11
sexy
sexy
sexy

In [16]:
n = 3
List = []
for i in range(n):
    s = "-".join(a[i:n])
    List.append(s[::-1]+s[1:])
width = len(List[0])
for i in range(n-1, 0, -1):
  print(List[i].center(width, "-"))
for i in range(n):
  print(List[i].center(width, "-")

SyntaxError: ignored

In [20]:
L = [3, 6, 7, 3, 10, 1, 3]
L.pop(3)

3

In [21]:
L

[3, 6, 7, 10, 1, 3]

In [22]:
L = [3, 6, 7, 3, 10, 1, 3]
L.pop(3)
L

[3, 6, 7, 10, 1, 3]

In [23]:
print(list(range(10, 1, -1)))

[10, 9, 8, 7, 6, 5, 4, 3, 2]

In [30]:
n=int(input())
n1, n2 = 0, 1
print(n1)
print(n2)
for i in range(2, n):
    n3 = n1 + n2
    n1 = n2
    n2 = n3
    print(n3)

7
0
1
1
2
3
5
8

In [31]:

L = [for i in range(1, 5): i]

SyntaxError: ignored

In [32]:
L=[2, 3, 4, 2, 1, 2, 3]
print(L.index(2))

0

In [35]:
L = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
L[1:-1:2]

[20, 40, 60, 80]

In [34]:
[L[i] for i in range(1,9,2)]

[20, 40, 60, 80]

In [38]:
import math

In [39]:
import numpy as np

In [40]:
np.mean(L)

55.0

In [41]:
for i in range(1, n+1):
    for j in range(0, n-i+1):
        print(' ', end='')
 
    # first element is always 1
    C = 1
    for j in range(1, i+1):
 
        # first value in a line is always 1
        print(' ', C, sep='', end='')
 
        # using Binomial Coefficient
        C = C * (i - j) // j
    print()

        1
       1 1
      1 2 1
     1 3 3 1
    1 4 6 4 1
   1 5 10 10 5 1
  1 6 15 20 15 6 1

In [42]:
L = [1, 2, 3, 4]
def cube_func(n):
    return n**3
print(list(map(cube_func, L)))

[1, 8, 27, 64]

In [43]:
L = [13, 16, 2, 19, 22, 24, 10, 49, 28, 82, 18]
final = []

for i in range(len(L)):
    if L[i]%9 == 1:
        final.append(L[i])

print(final)

[19, 10, 28, 82]

In [44]:
l = [0, 8, 16, 10, 36, 44, 93]

final = [int(x**0.5) for x in l if x**0.5 - int(x**0.5) == 0]
        
print(final)

[0, 4, 6]

In [45]:
print(chr(51))

3

In [46]:
print("Hello World"[::-1])

dlroW olleH

In [47]:
S = 'Python'
S[1] = 'i'

TypeError: ignored

In [50]:
s = 'I love Python'
s = s.split(" ")
s = s[-1::-1]
s = " ".join(s)
print(s)

Python love I

In [51]:
value=input()

# Hint
a = value.strip()
sep = a.replace(',','')
jo = ''.join(sep)
out = int(jo)
print(out)

1,23,555
123555

In [52]:
a = 7

def func(a):
    print('a is', a)
    a = 4
    print('a is now', a)
    
func(a)
print('a is finally', a)

a is 7
a is now 4
a is finally 7

In [53]:
d = {1:2, 2:3, 3:4}
d.pop(2)
print(d)

{1: 2, 3: 4}

In [54]:
a = {1, 2, 3, 4}
b = {3, 4, 5, 6}
print(a ^ b)

{1, 2, 5, 6}

In [55]:
def maxDistance(mylist, n):       
    mp = {} 

    maxDict = 0
    for i in range(n): 
        if mylist[i] not in mp.keys(): 
            mp[mylist[i]] = i   
        else: 
            maxDict = max(maxDict, i-mp[mylist[i]]) 
    return maxDict 

input_list = [3, 2, 1, 2, 1, 4, 5, 8, 6, 7, 4, 2] 
n = len(input_list) 
print(maxDistance(input_list, n))

10

In [1]:
%load_ext sql

In [4]:
%sql

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [5]:
%%sql
sqlite:///test.db

'Connected: @test.db'

In [6]:
%%sql 
create table student (sid int primary key, sname text, age int, address text);

 * sqlite:///test.db
Done.

[]

In [7]:
%%sql
create table teacher(tid int , tname text, age int, address text);

 * sqlite:///test.db
Done.

[]

In [8]:
%%sql
insert into student values(1, 'aki',27,'bangalore'),(2,'anu',26,'shimoga'),(3,'soma',22,'hasan'),(4,'rama',28,'tumkur'),(5,'reena',27,'kgf');

 * sqlite:///test.db
5 rows affected.

[]

In [9]:
%%sql
create table company(cid int , cname text, cage int, address text);

 * sqlite:///test.db
Done.

[]

In [11]:
%%sql
insert into company values(1, 'loa',27,'bangalore'),(2,'hoha',26,'shimoga'),(3,'siya',22,'hasan'),(4,'sham',28,'tumkur'),(5,'rea',27,'kgf'),(6, 'roloa',27,'mangalore'),(7,'goha',23,'hubli'),(8,'rasiya',10,'gulbarga'),(9,'ham',228,'chennai'),(10,'hyrea',227,'delhi');

 * sqlite:///test.db
10 rows affected.

[]

In [13]:
%%sql
select * from company;

 * sqlite:///test.db
Done.

[(1, 'loa', 27, 'bangalore'),
 (2, 'hoha', 26, 'shimoga'),
 (3, 'siya', 22, 'hasan'),
 (4, 'sham', 28, 'tumkur'),
 (5, 'rea', 27, 'kgf'),
 (6, 'roloa', 27, 'mangalore'),
 (7, 'goha', 23, 'hubli'),
 (8, 'rasiya', 10, 'gulbarga'),
 (9, 'ham', 228, 'chennai'),
 (10, 'hyrea', 227, 'delhi')]

In [12]:
import pandas as pd

In [18]:
import sqlite3
conn = sqlite3.connect('test.db')
print('opened db successfully')

opened db successfully

In [23]:
conn.execute('create table company1(cid int, cname text,age int, caddress text)')

In [34]:
conn.execute("insert into company1 values (1,'lower',22,'Bangalore'),(2,'upper',22,'delhi'),(3,'middle',21,'nagpur'),(4,'left',11,'ahmedabad'),(5,'right',10,'kolkata')");

In [35]:
df = pd.read_sql_query('select * from company1',conn)

In [36]:
df

    cid   cname  age   caddress
0     1   lower   22  Bangalore
1     2   upper   22      delhi
2     3  middle   21     nagpur
3     4    left   11  ahmedabad
4     5   right   10    kolkata
5     1   lower   22  Bangalore
6     2   upper   22      delhi
7     3  middle   21     nagpur
8     4    left   11  ahmedabad
9     5   right   10    kolkata
10    1   lower   22  Bangalore
11    2   upper   22      delhi
12    3  middle   21     nagpur
13    4    left   11  ahmedabad
14    5   right   10    kolkata

In [22]:
df[0:3]

   cid cname  cage    address
0    1   loa    27  bangalore
1    2  hoha    26    shimoga
2    3  siya    22      hasan

In [45]:
cur = conn.execute('select * from company1')
for x in cur:
  print('id=',x[0],'cname=',x[1])

id= 1 cname= lower
id= 2 cname= upper
id= 3 cname= middle
id= 4 cname= left
id= 5 cname= right
id= 1 cname= lower
id= 2 cname= upper
id= 3 cname= middle
id= 4 cname= left
id= 5 cname= right
id= 1 cname= lower
id= 2 cname= upper
id= 3 cname= middle
id= 4 cname= left
id= 5 cname= right

In [48]:
a = conn.execute("update company1 set cname='sada'where cid=1")

In [47]:
conn.commit()

In [50]:
b = conn.execute('select * from company1')

In [51]:
b

In [52]:
for x in b:
  print(x)

(1, 'sada', 22, 'Bangalore')
(2, 'upper', 22, 'delhi')
(3, 'middle', 21, 'nagpur')
(4, 'left', 11, 'ahmedabad')
(5, 'right', 10, 'kolkata')
(1, 'sada', 22, 'Bangalore')
(2, 'upper', 22, 'delhi')
(3, 'middle', 21, 'nagpur')
(4, 'left', 11, 'ahmedabad')
(5, 'right', 10, 'kolkata')
(1, 'sada', 22, 'Bangalore')
(2, 'upper', 22, 'delhi')
(3, 'middle', 21, 'nagpur')
(4, 'left', 11, 'ahmedabad')
(5, 'right', 10, 'kolkata')

In [55]:
 conn.execute('')

OperationalError: ignored